[{"_id": {"$oid": "5fe78a012e47d2042cf0ca92"}, "courseCode": "CS 425", "courseName": "Advanced Computer Networks", "semester": "Autumn", "instructor": "Prof. Siba Narayan Swain", "summary": ["Circuit, Packet and Virtual Circuit Switching, MPLS ", "Switch Architectures, Buffering Strategies, Input and Output Queuing, IP Buffer Sizing", "Quality of Service and Scheduling Algorithms", "IP Address Lookup and IP Packet Classification algorithms", "Software Defined Networking", "Next Generation Network Architectures, Network Provisioning and Design, and “Green” (Energy-Efficient) Networking", "Data Driven Networking"], "need": "The objective of this course is to cover theoretical topics in the areas of advanced networking protocols and related mechanisms/algorithms. In particular, we will study the internal components and mechanisms of a network router/switch. Further, we will also look into several advanced topics in networks pertaining to Software Defined Networking (SDN), Network Function Virtualization (NFV), and Data Driven Networking. The course also requires students to implement programming assignments related to the above topics.", "credits": "6", "rating": "0", "reviews": []}, {"_id": {"$oid": "5fe78a012e47d2042cf0ca93"}, "courseCode": "CS 423", "courseName": "Advanced topics in Embedded Computing", "semester": "Autumn", "instructor": "Dr Gayathri Ananthanarayanan ", "summary": ["Introduction to systems software in embedded platforms Boot loader, Embedded Linux kernel (Processes, Threads, Interrupts), Device Drivers, Scheduling Policies (including Real Time), Memory Management, Optimizations (Data level and Memory level), Embedded Systems Security, Introduction to Embedded GPUs and Accelerators, Embedded Heterogenous Programming with Open CL Application Case Study on Embedded Platforms – eg. Neural Network inferencing on Embedded Platforms, Advanced Driver Assistance Systems"], "need": "The use of embedded computing systems has prolifereated in our lives starting from consumer devices, such as smartphones and game consoles, to less visible electronic devices that control, for instance, different aspects of a car's operation. Typical embedded applications are targeted to run in heavily constrained environements. The aim of this course is to develop interdisciplinary skills such that the students can understand the limitations of the underlying hardware and accompanying runtime support and also teach them how to develop solutions able to meet stringent nonfunctional requirements, such as performance in current and emerging embedded computing systems.", "credits": "6", "rating": "0", "reviews": []}, {"_id": {"$oid": "5fe78a012e47d2042cf0ca94"}, "courseCode": "CS 421", "courseName": "Logic for Computer Science", "semester": "Autumn", "instructor": "Dr Gayathri Ananthanarayanan ", "summary": ["Module 1 :Propositional Logic: Syntax, Semantics, Normal Forms, Boolean Functions. Module 2: Computational complexity of Satisfiability P vs NP, SAT: hardest among NP. Module 3: Syntactic SAT solvers : Resolution, Tableaux. Module 4:proof Systems: Semantic entailment, Compactness, Soundess Completeness, Natural Deduction, Gentzen Sequent Calculus, Hilbert System. Module 5: Predicate Logic. Randomized SAT solvers. Programming assignments: using SAT/SMT solver z3."], "need": "This course introduces notions and methods of formal logic from a computer science standpoint, covering propositional logic, predicate logic and foundations of SAT solvers. It presents applications and themes of computer science research such as resolution and automated deduction.", "credits": "6", "rating": "0", "reviews": [{"name": "Putti Gowtham Sai", "email": "190010036@iitdh.ac.in", "review": "rrere", "time": "08-January-2021 22:33 ", "imgUrl": "https://lh3.googleusercontent.com/a-/AOh14Gi3rxavPrT5G1wnDLCEtlNjf19GzNl05qfbAvF9ow=s96-c", "show": true}]}, {"_id": {"$oid": "5fe78a012e47d2042cf0ca95"}, "courseCode": "CS 402", "courseName": "Distributed Systems", "semester": "Autumn", "instructor": "Dr. Kedar Khandeparkar", "summary": ["Introduction to distributed systems, Message Passing, Leader Election, Distributed Models, Causality and Logical Time  Logical Time, Global State & Snapshot and Distributed Mutual Exclusion-NonToken and Quorum based approaches  Distributed Mutual Exclusion-Token based approaches, Consensus & Agreement, Checkpointing & Rollback Recovery  Deadlock Detection, DSM and Distributed MST  Termination Detection, Message Ordering & Group Communication, Fault Tolerance and Self-Stabilization, Gossip Style communication, chord, pastry  Concurrency and Replication Control, RPCs, Transactions  Distributed Randomized Algorithms, DHT and P2P Computing  Case Studies: GFS, HDFS, Map Reduce and Spark"], "need": "Technologies such as Hadoop, Cassandra, Spark, etc., that have emerged in the recent times are mainly based on the principles of distributed systems. This course aims to develop an in-depth understanding of the various distributed algorithms and discuss some use cases.", "credits": "6", "rating": "0", "reviews": []}, {"_id": {"$oid": "5fe78a012e47d2042cf0ca96"}, "courseCode": "CS 305", "courseName": "Software Engineering", "semester": "Autumn", "instructor": "NLS", "summary": ["Introduction", "Software Development Life-cycle", "Software life-cycle models", "Software Requirement Specification", "System Design", "Coding", "Testing", "Software Project Management"], "need": "To teach students the engineering approach to software development starting from understanding and documenting user requirements to the design, development, testing and release management where we all take into account non-functional requirements and engineer them explicitly. The course brings out various lifecycle activities in the conventional as well as agile methodologies. It emphasizes modern practices and tools for a successful engineering of a usable and maintainable product.", "credits": "6", "rating": "0", "reviews": []}, {"_id": {"$oid": "5ff1c6b791f50c3aa8bb60bc"}, "courseCode": "CS 408", "courseName": "Statisitcal Pattern Recognition", "instructor": "Prof. Prabhuchandran KJ", "summary": ["Bayesian Decision Making and Bayes Classifier, Parametric and Non Parametric Estimation of Densities, General Linear Models, Discriminative Learning based Models, Dimensionality Reduction Techniques, Empirical and Structural risk minimization, Ensemble Methods, Pattern Clustering"], "need": "This course provides theoretical/statistical underpinnings of pattern recognition and machine learning methods.", "semester": "Spring", "rating": "0", "reviews": []}, {"_id": {"$oid": "5ff1c6b791f50c3aa8bb60bd"}, "courseCode": "CS 412", "courseName": "Statisitcal Pattern Recognition Lab", "instructor": "Prof. Prabhuchandran KJ", "summary": ["The lab will closely follow the theory course. The idea is to have the students\r\nimplement the basic algorithms on different topics studied in the statistical pattern\r\nrecognition theory course. "], "need": "SPR Laboratory is important to reinforce different concepts that will be studied as part of the theory course.", "semester": "Spring", "rating": "0", "reviews": []}]